<a href="https://colab.research.google.com/github/YHdoc/C-and-Python/blob/main/%E2%80%8D%EC%98%A4%EC%98%81%ED%9B%88%5B%EC%9E%AC%ED%95%99_%EC%82%AC%ED%95%99%EA%B3%BC%5D_ch5_homework_2021_student.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Homework - SQL1

1. Use Google Colabortory and do your homework.
3. (In Google colaboratory) Before you submit your homework, restart kernel and run every cell!
4. Save (File->Save) the file
5. Submit your homework (this file) in Google classroom
6. **Don't forget to click "제출" button** ("Submit", "완료로 표시", 또는 "제출" 버턴을 누르지 않으면 제출된 것이 아님)
7. No late homeworks will be accepted for any reason!

To edit this cell, double click here
```
이름:___________오영훈____________
학번:_________201601994___________
학과:___________사학과____________
제출일:_______2021.11.14__________
```

- SQL 작성시, 문제에 주어지지 않은 상수를 사용하는 경우 (cheating), **마이너스 점수**를 받는다.

- **점수: 1번은 20점 나머지는 10점**

아래는 학생과 수업에 관련된 데이터베이스 테이블이다. 

![image.png](attachment:image.png)

In [130]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [132]:
!pip install pymysql

Requirement already satisfied: pymysql in /usr/local/lib/python3.7/dist-packages (1.0.2)

### Use your host, id, and password

In [131]:
import getpass
user = 's201601994'
password = getpass.getpass()
host='dm.hufs.ac.kr'
database = 's201601994db'
connection_string = f'mysql+pymysql://{user}:{password}@{host}:3306/{database}'
    
%sql $connection_string

··········

'Connected: s201601994@s201601994db'

### Use your s학번db database

In [133]:
%sql use s201601994db;

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
0 rows affected.

[]

#### 1.  관계형 데이터베이스 테이블 스키마(create table)을 생성하고, MySQL DBMS를 이용하여 테이블을 생성하시오. 

- 테이블은 적절한 컬럼 데이터 타입, Primary Key, Foreign Key (on delete, on update rule 포함, restrict, set null, cascade), 필요하다면 Unique, NOT NULL 등이 표시되어야 한다. 

- 조건: 선수과목 정보는 course 정보 때문에 유지하는 정보이다. 즉, Course가 삭제되면, 불필요한 정보이다.
- 스키마 작성시 9번 문제가 성공할 수 있도록 스키마를 작성하여야 한다.

- Semester은 enum type을 사용하여, 봄, 여름, 가을, 겨울 순서가 되게 한다.
- Grade는 enum type을 사용하여 A, B, C, D, F 순서가 되게 한다.

In [ ]:
#조건: 선수과목 정보는 course 정보 때문에 유지하는 정보이다. 즉, Course가 삭제되면, 불필요한 정보이다.

#스키마 작성시 9번 문제가 성공할 수 있도록 스키마를 작성하여야 한다.

#이 조건들은 foreign key 옵션을 뭘 선택하라고 강조하고 있는 것이다.

#enum type은 한번 뭔지 찾아보도록.

In [152]:

%%sql
-- YOUR CODE HERE


SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0;
SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0;

DROP TABLE IF EXISTS STUDENT;
DROP TABLE IF EXISTS COURSE;
DROP TABLE IF EXISTS SECTION;
DROP TABLE IF EXISTS GRADE_REPORT;
DROP TABLE IF EXISTS PREREQUISITE;

CREATE TABLE STUDENT
(       Name VARCHAR(15) NOT NULL,
        Student_number INT,
        Class INT,
        Major VARCHAR(15) NOT NULL,
        PRIMARY KEY (Student_number)
) ENGINE=InnoDB;

CREATE TABLE COURSE
(       Course_name VARCHAR(40) NOT NULL,
        Course_number VARCHAR(15) NOT NULL,
        Credit_hours INT,
        Department VARCHAR(15),
        PRIMARY KEY (Course_number)
) ENGINE=InnoDB;


CREATE TABLE SECTION
(       Section_identifier INT,
        Course_number VARCHAR(15) NOT NULL,
        Semester ENUM('Spring', 'Summer', 'Fall', 'Winter'),
        Year INT,
        Instructor VARCHAR(15),
        PRIMARY KEY (Section_identifier),
        FOREIGN KEY (Course_number)
                REFERENCES COURSE(Course_number) 
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE GRADE_REPORT
(       Student_number INT,
        Section_identifier INT,
        Grade ENUM('A', 'B', 'C', 'D', 'F'),
        PRIMARY KEY (Student_number, Section_identifier),
        FOREIGN KEY (Student_number)
                REFERENCES STUDENT(Student_number),
        FOREIGN KEY (Section_identifier)
                REFERENCES SECTION(Section_identifier)
) ENGINE=InnoDB;



CREATE TABLE PREREQUISITE
(       Course_number VARCHAR(9) NOT NULL,
        Prerequisite_number VARCHAR(9) NOT NULL,
        PRIMARY KEY (Course_number, Prerequisite_number),
        FOREIGN KEY (Course_number)
                REFERENCES COURSE(Course_number) 
                ON DELETE CASCADE
                ON UPDATE CASCADE,
        FOREIGN KEY (Prerequisite_number) 
                REFERENCES COURSE(Course_number) 
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;


SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS;
SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS;

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

#### 2. 각 테이블에 위에 테이블에 주어진 행들을 “insert into”를 이용하여 행들을 

---

삽입하시오. Select \* from <table_name>를 이용하여 삽입의 성공 여부를 

---

확인하시오.

In [153]:
%%sql
-- YOUR CODE HERE

insert into STUDENT values
        ("Smith", 17, 1, "CS"),
        ("Brown", 8, 2, "CS");


insert into COURSE  values 
        ("Intro to Computer Science", "CS1310", 4,"CS"),
        ("Data Structures", "CS3320", 4,"CS"),
        ("Discrete Mathematics", "MATH2410", 3,"MATH"),
        ("Database", "CS3380", 3,"CS");


insert into SECTION values 
        (85, "MATH2410", "Fall", 07, "King"),
        (92, "CS1310", "Fall", 07, "Anderson"),
        (102, "CS3320", "Spring", 08, "Knuth"),
        (112, "MATH2410", "Fall", 08, "Chang"),
        (119, "CS1310", "Fall", 08, "Anderson"),
        (135, "CS3380", "Fall", 08, "Stone");

insert into GRADE_REPORT values 
        (17, 112, 'B'),
        (17, 119, 'C'),
        (8, 85, 'A'),
        (8, 92, 'A'),
        (8, 102, 'B'),
        (8, 135, 'A');


insert into PREREQUISITE values 
        ("CS3380", "CS3320"),
        ("CS3380", "MATH2410"),
        ("CS3320", "CS1310");

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
2 rows affected.
4 rows affected.
6 rows affected.
6 rows affected.
3 rows affected.

[]

### Run the following cell to show that insert is correctly done

In [ ]:
%sql select * from STUDENT;

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
2 rows affected.

[('Brown', 8, 2, 'CS'), ('Smith', 17, 1, 'CS')]

In [ ]:
%sql select * from COURSE;

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
4 rows affected.

[('Intro to Computer Science', 'CS1310', 4, 'CS'),
 ('Data Structures', 'CS3320', 4, 'CS'),
 ('Database', 'CS3380', 3, 'CS'),
 ('Discrete Mathematics', 'MATH2410', 3, 'MATH')]

In [ ]:
%sql select * from SECTION;

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
6 rows affected.

[(85, 'MATH2410', 'Fall', 7, 'King'),
 (92, 'CS1310', 'Fall', 7, 'Anderson'),
 (102, 'CS3320', 'Spring', 8, 'Knuth'),
 (112, 'MATH2410', 'Fall', 8, 'Chang'),
 (119, 'CS1310', 'Fall', 8, 'Anderson'),
 (135, 'CS3380', 'Fall', 8, 'Stone')]

In [172]:
%sql select * from GRADE_REPORT;

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
6 rows affected.

[(8, 85, 'A'),
 (8, 92, 'A'),
 (8, 102, 'B'),
 (8, 135, 'A'),
 (17, 112, 'B'),
 (17, 119, 'C')]

In [ ]:
%sql select * from PREREQUISITE;

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
3 rows affected.

[('CS3320', 'CS1310'), ('CS3380', 'CS3320'), ('CS3380', 'MATH2410')]

#### 3. Database 과목을 수강한 학생들의 이름을 나열하시오.

In [ ]:
#5장에서 배운 방법으로만 풀도록.

%%sql
-- YOUR CODE HERE
select Name
from STUDENT, COURSE, SECTION, GRADE_REPORT
where Course_name = "Database" and COURSE.Course_number = SECTION.Course_number and SECTION.Section_identifier = GRADE_REPORT.Section_identifier and GRADE_REPORT.Student_number = STUDENT.Student_number

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
1 rows affected.

[('Brown',)]

#### 4. Grade_report테이블에 <8, 112, NULL> 행을 삽입하시오. 동일한 과목(course)을 두 번 이상 수강한 학생의 이름을 찾으시오.

In [137]:
%sql insert into GRADE_REPORT values (8, 112, NULL);

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
1 rows affected.

[]

In [138]:
%%sql
select NAME
from STUDENT
where Student_number IN (
  select ST.Student_number
  from SECTION S1, SECTION S2, GRADE_REPORT G1, GRADE_REPORT G2, STUDENT ST
  where S1.Course_number = S2.Course_number and S1.Section_identifier != S2.Section_identifier and G1.Student_number = G2.Student_number and G1.Section_identifier != G2.Section_identifier and S1.Section_identifier = G1.Section_identifier and S2.Section_identifier = G2.Section_identifier and ST.Student_number = G1.Student_number
)

# select S1.Section_identifier
# from SECTION S1, SECTION S2, GRADE_REPORT G1, GRADE_REPORT G2
# where S1.Course_number = S2.Course_number and S1.Section_identifier != S2.Section_identifier and G1.Student_number = G2.Student_number and G1.Section_identifier != G2.Section_identifier and S1.Section_identifier = G1.Section_identifier and S2.Section_identifier = G2.Section_identifier

# select ST.Student_number
# from SECTION S1, SECTION S2, GRADE_REPORT G1, GRADE_REPORT G2, STUDENT ST
# where S1.Course_number = S2.Course_number and S1.Section_identifier != S2.Section_identifier and G1.Student_number = G2.Student_number and G1.Section_identifier != G2.Section_identifier and S1.Section_identifier = G1.Section_identifier and S2.Section_identifier = G2.Section_identifier and ST.Student_number = G1.Student_number

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
1 rows affected.

[('Brown',)]

#### 5. Database 과목을 듣기 위해 (직접 또는 간접적으로: directly or indirectly) 미리 들어야 하는(prerequisite) 과목(Course_name)들을 모두 나열하시오. (Prerequisite는 Acyclic graph이고 path의 최대 길이는 3이라고 가정함. 길이 3: A-B-C-D)

In [ ]:
%%sql
-- YOUR CODE HERE
# 뭐하고 union, 뭐하고 union, 또 뭐하고 union..해서 풀어야 할 텐데 이를 무한정 할 수는 없어 길이가 최대 3이라고 가정했다.
# 나중 가면 순환적 폐포연산으로 풀 수 있는데.. 아직 배우진 않음. Prerequisite의 최대 길이가 3이라고 간주한다고 했다.
# 길이가 3이라는 말은 노드는 4개라는 말이다. A와 B사이, B와 C사이, C와 D사이.
# 제임스 보그의 부하직원의 부하직원의 부하직원을 찾아 union 한 것과 똑같은 형태이다!

select PRE1.Prerequisite_number
from PREREQUISITE PRE1
where PRE1.Course_number IN(
  select C.Course_number
  from COURSE C
  where C.Course_name = "Database"
)

union

select PRE2.Prerequisite_number
from PREREQUISITE PRE2, PREREQUISITE PRE3
where PRE2.Course_number = PRE3.Prerequisite_number and PRE2.Course_number IN(
  select P.Course_number
  from PREREQUISITE P, COURSE C
  where Course_name = "Database"
)

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
3 rows affected.

[('CS3320',), ('MATH2410',), ('CS1310',)]

In [ ]:
#개인적으로 위 방식을 검토해보는 코드

%%sql

select *
from PREREQUISITE PRE2, PREREQUISITE PRE3
where PRE2.Course_number = PRE3.Prerequisite_number and PRE2.Course_number IN(
  select P.Course_number
  from PREREQUISITE P, COURSE C
  where Course_name = "Database"
)

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
1 rows affected.

[('CS3320', 'CS1310', 'CS3380', 'CS3320')]

#### 6. 전공으로 수강한 과목들만 나열하는 MAJOR_GRADE_REPORT테이블을 만드시오. 테이블을 생성하고, GRADE_REPORT 테이블에서 전공으로 수강한 경우에 해당하는 행들만 아래 테이블에 삽입하시오. 전공으로 수강하였다는 것은 학생의 전공(Major)과 COURSE의 개설 Department가 같으면 전공으로 수강한 과목이다.
   
    MAJOR_GRADE_REPORT(Student_number, Section_identifier, Grade)

In [170]:
%%sql
-- YOUR CODE HERE
# 교재에서 Dept_info에 value를 통해 투플값을 일일이 insert 해준 것이 아니라 select를 해서 insert를 해주었다.
# '전공으로 수강한 과목들만 나열하는 MAJOR_GRADE_REPORT테이블을 만드시오'라는 말은 : 전공으로 수강했다는 것은 학생의 전공이 CS인데, 그 코스를 개설한 부서(학과)가 CS이다. 
# 그러면 전공으로 들었다고 간주하는 것. 그런 것만 뽑아 -> MAJOR_GRADE_REPORT(Student_number, Section_identifier, Grade) :  이 테이블에 집어넣으라는 말이다.


DROP TABLE IF EXISTS MAJOR_GRADE_REPORT;

CREATE TABLE MAJOR_GRADE_REPORT
(       Student_number INT,
        Section_identifier INT,
        Grade ENUM('A', 'B', 'C', 'D', 'F'),
        PRIMARY KEY (Student_number, Section_identifier),
        FOREIGN KEY (Student_number)
                REFERENCES STUDENT(Student_number),
        FOREIGN KEY (Section_identifier)
                REFERENCES SECTION(Section_identifier)
) ENGINE=InnoDB;

insert into MAJOR_GRADE_REPORT(Student_number, Section_identifier, Grade)
select S.Student_number, SE.Section_identifier, GR.Grade
from STUDENT S, COURSE C, SECTION SE, GRADE_REPORT GR
where S.Major = C.Department and SE.Section_identifier = GR.Section_identifier and C.Course_number = SE.Course_number and S.Student_number = GR.Student_number



# select *
# from STUDENT S, COURSE C
# where S.Major = C.Department and C.Course_number in(
#   select distinct SE.Course_number
#   from SECTION SE, GRADE_REPORT GR
#   where SE.Section_identifier = GR.Section_identifier 
#   Order by SE.Section_identifier
# )

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
0 rows affected.
0 rows affected.
4 rows affected.

[]

### Run the following cell to show that insert is correctly done

In [171]:
%sql select * from MAJOR_GRADE_REPORT;

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
4 rows affected.

[(8, 92, 'A'), (8, 102, 'B'), (8, 135, 'A'), (17, 119, 'C')]

#### 7. 모든 학생들의 성적들을 다음과 같이 출력하려 한다. 적절한 SQL문을 작성하여 실행하시오. 
- 결과 테이블은 Major, Student_number, Year, Semester, Course_number 순서로 정렬되어야 한다.
- 결과 테이블 애트리뷰트 이름 및 순서: (Major, Student_number, Student_name, Year, Semester, Course_number, Course_name, Grade)

In [ ]:
%%sql
-- YOUR CODE HERE
# 정렬하라는 것은 order by를 쓰라는 것

SELECT DISTINCT Major, ST.Student_number, Name, Year, Semester, C.Course_number, Course_name, Grade
FROM STUDENT ST, COURSE C, SECTION SE, GRADE_REPORT GR
WHERE ST.Student_number = GR.Student_number and C.Course_number = SE.Course_number and SE.Section_identifier = GR.Section_identifier
ORDER BY Major, Student_number, Year, Semester, Course_number

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
7 rows affected.

[('CS', 8, 'Brown', 7, 'Fall', 'CS1310', 'Intro to Computer Science', 'A'),
 ('CS', 8, 'Brown', 7, 'Fall', 'MATH2410', 'Discrete Mathematics', 'A'),
 ('CS', 8, 'Brown', 8, 'Spring', 'CS3320', 'Data Structures', 'B'),
 ('CS', 8, 'Brown', 8, 'Fall', 'CS3380', 'Database', 'A'),
 ('CS', 8, 'Brown', 8, 'Fall', 'MATH2410', 'Discrete Mathematics', None),
 ('CS', 17, 'Smith', 8, 'Fall', 'CS1310', 'Intro to Computer Science', 'C'),
 ('CS', 17, 'Smith', 8, 'Fall', 'MATH2410', 'Discrete Mathematics', 'B')]

#### 8. Brown이 수강한 Database 과목의 학점을 F로 수정하시오.

In [ ]:

%%sql
# 학생 찾고, select하고, ~이 거기에 속하면 F로 바꿔주어야 한다.
-- YOUR CODE HERE
UPDATE GRADE_REPORT
SET Grade = 'F'
WHERE Section_identifier IN (
  SELECT Section_identifier
  FROM STUDENT ST, COURSE C, SECTION SE
  WHERE ST.Name = "Brown" and C.Course_name = "Database" and SE.Course_number = C.Course_number
)

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
1 rows affected.

[]

### Run the following cell to show that update is correctly done

In [ ]:
%sql select * from GRADE_REPORT where Student_number = 8 and Section_identifier = 135;

#### 9. Brown의 학번을 8번에서 9번으로 수정하시오. 반드시 update문 하나만 있어야 하며, update 문은 반드시 성공하여야 한다. 테이블의 Foreign Key 선언문을 삭제하면 안됨.

In [ ]:
%%sql
-- YOUR CODE HERE
# 브라운의 학번을 8->9로 수정하면, 자동으로 바뀌게끔 foreign key 옵션을 저 위에서 수정하라는 것이다.(테이블에서 수정하라는 말인듯)

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
0 rows affected.

[]

### Run the following cell to show that update is correctly done

In [ ]:
%sql select * from STUDENT where name = 'Brown';